/* У тризначному числi, всi цифри якого непаpнi, закpеслили середню цифру. 
Виявилось, що отpимане двозначне число є дiльником вихiдного числа. Знайдiть всi такi тризначнi числа. */
odd(X):-X mod 2=:=1.
task1(ABC):-
digit(A),A>0,odd(A),
digit(B),odd(B),
digit(C),odd(C),
ABC is 100*A+10*B+C,
AC is 10*A+C,
0=:=ABC mod AC.

/*Знайдiть чотиризначне число, яке є точним квадратом, у якого двi першi цифри однаковi та двi останнi також однаковi. */
task2(AABB):-
digit(A),A>0,digit(B),
AABB is 1100*A+11*B,
S is floor(sqrt(AABB)),
AABB=:=S*S.

/* Скiльки iснує цiлих чисел вiд 1 до 1998, якi не дiляться на жодне з чисел 6, 10, 15? */
notDividing(X):- \+X mod 6 =:= 0,\+ X mod 10 =:= 0,\+ X mod 15 =:= 0.
run3(C,1998,C):-!.
run3(Res,I,C):-
notDividing(I),
I1 is I+1,
C1 is C+1,
run3(Res,I1,C1),!.
run3(Res,I,C):- I1 is I+1, run3(Res,I1,C).
task3(X):-run3(X,1,0).

/*Знайти найменше натуральне число M, яке має наступну властивiсть: 
сума квадратiв одинадцяти послiдовних натуральних чисел, починаючи з M, є точним квадратом? */
sumofsqr(X,Y):- Y is X*X + 
(X+1)*(X+1)+
(X+2)*(X+2)+
(X+3)*(X+3)+ 
(X+4)*(X+4)+
(X+5)*(X+5)+ 
(X+6)*(X+6)+ 
(X+7)*(X+7)+ 
(X+8)*(X+8)+ 
(X+9)*(X+9)+  
(X+10)*(X+10).
% довелося переробити те, що ми розглядали на парі, бо той варіант перевіряв лише одиничку, а коли я дописала лічильник повертав число в квадраті
% оскільки саме та змінна передавалася в функцію sumofsqr як змінна в яку записувався результат.
run4(M,I):- sumofsqr(I,M2), 
S is floor(sqrt(M2)), 
M2=:= S*S,M=I,!. 
run4(M,I):-I1 is I+1,run4(M,I1).
task4(M):-run4(M,1).

/* В послiдовностi 1998737... кождна цифра, починаючи з п'ятої, дорiвнює останнiй цифрi суми чотирьох попеpеднiх цифр. 
sЧерез скiльки цифр знову зустрiнитья початкова комбiнацiя 1998 (тобто скiльки цифр в перiодi)? */
run5(D1,D2,D3,D4,C,M):-
D1 is 1,D2 is 9, D3 is 9, D4 is 8, M is C, !.
run5(D1,D2,D3,D4,C,M):-
D5 is(D1+D2+D3+D4) mod 10,
C1 is C+1,
run5(D2,D3,D4,D5,C1,M).
task5(M):-run5(8,7,3,7,3,M).